In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [3]:
df

                   A         B         C         D
2013-01-01 -0.550319  0.137359 -0.486693  0.117753
2013-01-02 -0.003219  0.760244  0.045564  1.049509
2013-01-03 -0.433115  0.126467  0.929504  1.222752
2013-01-04  1.075744  1.477946 -1.182395 -0.201998
2013-01-05  1.935225 -0.706395  0.399068  1.834261
2013-01-06  0.564098 -0.406902 -0.740786  0.577285

In [4]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [6]:
df.values# dataframe to numpy.array

array([[-0.55031948,  0.13735852, -0.48669329,  0.11775279],
       [-0.00321936,  0.76024353,  0.04556414,  1.04950881],
       [-0.43311467,  0.12646735,  0.9295045 ,  1.22275153],
       [ 1.07574355,  1.47794557, -1.18239501, -0.20199832],
       [ 1.93522462, -0.70639497,  0.39906752,  1.83426101],
       [ 0.56409818, -0.40690238, -0.74078602,  0.57728483]])

In [7]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.117753 -0.486693  0.137359 -0.550319
2013-01-02  1.049509  0.045564  0.760244 -0.003219
2013-01-03  1.222752  0.929504  0.126467 -0.433115
2013-01-04 -0.201998 -1.182395  1.477946  1.075744
2013-01-05  1.834261  0.399068 -0.706395  1.935225
2013-01-06  0.577285 -0.740786 -0.406902  0.564098

In [8]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05  1.935225 -0.706395  0.399068  1.834261
2013-01-06  0.564098 -0.406902 -0.740786  0.577285
2013-01-03 -0.433115  0.126467  0.929504  1.222752
2013-01-01 -0.550319  0.137359 -0.486693  0.117753
2013-01-02 -0.003219  0.760244  0.045564  1.049509
2013-01-04  1.075744  1.477946 -1.182395 -0.201998

In [9]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.550319  0.137359 -0.486693  0.117753
2013-01-02 -0.003219  0.760244  0.045564  1.049509
2013-01-03 -0.433115  0.126467  0.929504  1.222752

In [10]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.550319  0.137359
2013-01-02 -0.003219  0.760244
2013-01-03 -0.433115  0.126467
2013-01-04  1.075744  1.477946
2013-01-05  1.935225 -0.706395
2013-01-06  0.564098 -0.406902

In [11]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.003219  0.760244
2013-01-03 -0.433115  0.126467
2013-01-04  1.075744  1.477946

In [12]:
df.iloc[3]

A    1.075744
B    1.477946
C   -1.182395
D   -0.201998
Name: 2013-01-04 00:00:00, dtype: float64

In [13]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.003219  0.045564
2013-01-03 -0.433115  0.929504
2013-01-05  1.935225  0.399068

In [14]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  1.075744  1.477946
2013-01-05  1.935225 -0.706395

In [15]:
df[df.A > 0]

                   A         B         C         D
2013-01-04  1.075744  1.477946 -1.182395 -0.201998
2013-01-05  1.935225 -0.706395  0.399068  1.834261
2013-01-06  0.564098 -0.406902 -0.740786  0.577285

In [22]:
df[(df.A > 0)&(df.B<0)]

                   A         B         C  D   E
2013-01-05  1.935225 -0.706395  0.399068  0 NaN
2013-01-06  0.564098 -0.406902 -0.740786  0 NaN

In [16]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.137359       NaN  0.117753
2013-01-02       NaN  0.760244  0.045564  1.049509
2013-01-03       NaN  0.126467  0.929504  1.222752
2013-01-04  1.075744  1.477946       NaN       NaN
2013-01-05  1.935225       NaN  0.399068  1.834261
2013-01-06  0.564098       NaN       NaN  0.577285

In [17]:
df.loc[:,'D'] = 0

In [18]:
df

                   A         B         C  D
2013-01-01 -0.550319  0.137359 -0.486693  0
2013-01-02 -0.003219  0.760244  0.045564  0
2013-01-03 -0.433115  0.126467  0.929504  0
2013-01-04  1.075744  1.477946 -1.182395  0
2013-01-05  1.935225 -0.706395  0.399068  0
2013-01-06  0.564098 -0.406902 -0.740786  0

In [19]:
df['E']=np.nan
df

                   A         B         C  D   E
2013-01-01 -0.550319  0.137359 -0.486693  0 NaN
2013-01-02 -0.003219  0.760244  0.045564  0 NaN
2013-01-03 -0.433115  0.126467  0.929504  0 NaN
2013-01-04  1.075744  1.477946 -1.182395  0 NaN
2013-01-05  1.935225 -0.706395  0.399068  0 NaN
2013-01-06  0.564098 -0.406902 -0.740786  0 NaN

In [20]:
df.fillna(value=5)

                   A         B         C  D    E
2013-01-01 -0.550319  0.137359 -0.486693  0  5.0
2013-01-02 -0.003219  0.760244  0.045564  0  5.0
2013-01-03 -0.433115  0.126467  0.929504  0  5.0
2013-01-04  1.075744  1.477946 -1.182395  0  5.0
2013-01-05  1.935225 -0.706395  0.399068  0  5.0
2013-01-06  0.564098 -0.406902 -0.740786  0  5.0

In [21]:
df.mean(1)

2013-01-01   -0.224914
2013-01-02    0.200647
2013-01-03    0.155714
2013-01-04    0.342824
2013-01-05    0.406974
2013-01-06   -0.145898
Freq: D, dtype: float64